#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2022-03-15 04:55:50.004 +0000 UTC]
module.thadmin_hosting.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_hosting.aws_s3_bucket_acl.this: Refreshing state... [id=thalia-thadmin-staging,private]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1170-2532.jpg"]: Refreshing state... [id=apple-splash-1170-2532.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973-legacy.33d58026.js.map"]: Refreshing state... [id=js/973-legacy.33d58026.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.7a09bc7f.js"]: Refreshing state... [id=js/chunk-vendors-legacy.7a09bc7f.js]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.7a09bc7f.js.map"]: Refreshing state... [id=js/chunk-vendors-legacy.7a09bc7f.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1334-750.jpg"]: Refreshing state... [id=apple-splash-1334-750.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2160-1620.jpg"]: Refreshing state... [id=apple-splash-2160-1620.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2688.jpg"]: Refreshing state... [id=apple-splash-1242-2688.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.013744a8.js.map"]: Refreshing state... [id=js/app-legacy.013744a8.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973-legacy.33d58026.js"]: Refreshing state... [id=js/973-legacy.33d58026.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.0833f3cd.css"]: Refreshing state... [id=css/chunk-vendors.0833f3cd.css]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2436-1125.jpg"]: Refreshing state... [id=apple-splash-2436-1125.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2388.jpg"]: Refreshing state... [id=apple-splash-1668-2388.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2388-1668.jpg"]: Refreshing state... [id=apple-splash-2388-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1620-2160.jpg"]: Refreshing state... [id=apple-splash-1620-2160.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.4c3c7b16.js.map"]: Refreshing state... [id=js/chunk-vendors.4c3c7b16.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.4a0e2ffb.js"]: Refreshing state... [id=js/app.4a0e2ffb.js]
module.thadmin_hosting.aws_s3_object.code_build_object["css/app.42c9e53b.css"]: Refreshing state... [id=css/app.42c9e53b.css]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-828-1792.jpg"]: Refreshing state... [id=apple-splash-828-1792.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1792-828.jpg"]: Refreshing state... [id=apple-splash-1792-828.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2732-2048.jpg"]: Refreshing state... [id=apple-splash-2732-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2224.jpg"]: Refreshing state... [id=apple-splash-1668-2224.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2208-1242.jpg"]: Refreshing state... [id=apple-splash-2208-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.4a0e2ffb.js.map"]: Refreshing state... [id=js/app.4a0e2ffb.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-1536.jpg"]: Refreshing state... [id=apple-splash-2048-1536.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1536-2048.jpg"]: Refreshing state... [id=apple-splash-1536-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2532-1170.jpg"]: Refreshing state... [id=apple-splash-2532-1170.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1136-640.jpg"]: Refreshing state... [id=apple-splash-1136-640.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1284-2778.jpg"]: Refreshing state... [id=apple-splash-1284-2778.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973.32ceaabb.js.map"]: Refreshing state... [id=js/973.32ceaabb.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-2732.jpg"]: Refreshing state... [id=apple-splash-2048-2732.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.4c3c7b16.js"]: Refreshing state... [id=js/chunk-vendors.4c3c7b16.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2208.jpg"]: Refreshing state... [id=apple-splash-1242-2208.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["img/anonymousUser.c7a94bce.jpg"]: Refreshing state... [id=img/anonymousUser.c7a94bce.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-750-1334.jpg"]: Refreshing state... [id=apple-splash-750-1334.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2688-1242.jpg"]: Refreshing state... [id=apple-splash-2688-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1125-2436.jpg"]: Refreshing state... [id=apple-splash-1125-2436.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2778-1284.jpg"]: Refreshing state... [id=apple-splash-2778-1284.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"]: Refreshing state... [id=img/backgroundImage.24f22a44.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973.32ceaabb.js"]: Refreshing state... [id=js/973.32ceaabb.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2224-1668.jpg"]: Refreshing state... [id=apple-splash-2224-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.013744a8.js"]: Refreshing state... [id=js/app-legacy.013744a8.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-640-1136.jpg"]: Refreshing state... [id=apple-splash-640-1136.jpg]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag               = "407e69540c950ce3e893be2cbadd0f30-2" -> "5f59aad8b5eddf226c7e5a21939e4018"
        id                 = "img/backgroundImage.24f22a44.jpg"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag               = "dfe80b88aa9b97121fb0c4072be13b97" -> "7a10a1eda9d859698574f552390bfdcf"
        id                 = "index.html"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/973-legacy.33d58026.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "79808d1cfdfb62cbe93fb152caa5c1f0" -> null
      - force_destroy      = false -> null
      - id                 = "js/973-legacy.33d58026.js" -> null
      - key                = "js/973-legacy.33d58026.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/973-legacy.33d58026.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/973-legacy.33d58026.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "e1ce9bf236e8106d7c1217d5855cf80e" -> null
      - force_destroy      = false -> null
      - id                 = "js/973-legacy.33d58026.js.map" -> null
      - key                = "js/973-legacy.33d58026.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/973-legacy.33d58026.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/973-legacy.f2159c38.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "9b13199242b279a578724dc4a38b86d7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/973-legacy.f2159c38.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/973-legacy.f2159c38.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/973-legacy.f2159c38.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "1b0f7a1fc96a5d6ca97bf5cb28f66c6b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/973-legacy.f2159c38.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/973-legacy.f2159c38.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.013744a8.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "1b9691277120c994250ce86f1a4c13da" -> null
      - force_destroy      = false -> null
      - id                 = "js/app-legacy.013744a8.js" -> null
      - key                = "js/app-legacy.013744a8.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.013744a8.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.013744a8.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "70f1129b0c6c3140c4959f90508979eb" -> null
      - force_destroy      = false -> null
      - id                 = "js/app-legacy.013744a8.js.map" -> null
      - key                = "js/app-legacy.013744a8.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.013744a8.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.d4e8d57b.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "87618ff999d6cc8fcd80b6f498a00ff7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app-legacy.d4e8d57b.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.d4e8d57b.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.d4e8d57b.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "7609fd14f7d2874c5d34cfa67a223e7d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app-legacy.d4e8d57b.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.d4e8d57b.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.4a0e2ffb.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "6af04d75105b5df859f871defe5fcd01" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.4a0e2ffb.js" -> null
      - key                = "js/app.4a0e2ffb.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.4a0e2ffb.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.4a0e2ffb.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "af25a7b2bf8b7cba5a700debfddba7b1" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.4a0e2ffb.js.map" -> null
      - key                = "js/app.4a0e2ffb.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.4a0e2ffb.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.f2c9afa2.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "aa021879c98ccc9683a89e1301ae131e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.f2c9afa2.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.f2c9afa2.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.f2c9afa2.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "bca76d7f8fc4695b50a4f1d45b7e1e0e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.f2c9afa2.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.f2c9afa2.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.7a09bc7f.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "1a287ed72784d2351b35aba3a71a3bb7" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors-legacy.7a09bc7f.js" -> null
      - key                = "js/chunk-vendors-legacy.7a09bc7f.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.7a09bc7f.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.7a09bc7f.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "3dc8344fed9b7fff103f1ad62b411c28" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors-legacy.7a09bc7f.js.map" -> null
      - key                = "js/chunk-vendors-legacy.7a09bc7f.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.7a09bc7f.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.a02ac1bf.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "1e7fd547268b025a973230ea0365af37"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors-legacy.a02ac1bf.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.a02ac1bf.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.a02ac1bf.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d73fd5a24721a1fc572260fac7f37981"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors-legacy.a02ac1bf.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.a02ac1bf.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 8 to add, 2 to change, 8 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_profile" but a value
was found in file "terraform.tfvars". To use this value, add a "variable"
block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>